{"id":"medium_c4c1de27","title":"🕒 How I Overcame Laziness Using a 3-Minute Rule","text":"🕒 How I Overcame Laziness Using a 3-Minute Rule\n\nAnd how it changed the way I approach everything in life.\n\nI used to be the king of procrastination.\n\nI’d wake up with big dreams — finish that online course, clean my room, reply to emails, maybe even hit the gym.\n\nBut by noon, I’d still be scrolling through reels of cats making smoothies and people talking about how they became millionaires by 23.\n\nIt was frustrating. I wasn’t lazy because I lacked ambition. I was lazy because starting felt impossible.\n\nThen I discovered something ridiculously simple — the 3-Minute Rule.\n\nAnd it changed everything.\n\nThe Lowest Point: My Turning Moment\n\nI remember this specific morning. My desk was a mess. Assignments were overdue. My clothes were everywhere. But instead of doing something, I was lying on my bed, binge-watching a productivity video — ironically.\n\nHalfway through that video, the speaker casually mentioned:\n\n> “If something takes less than 3 minutes, just do it. Don’t plan. Don’t think. Just start.”\n\nThat hit me.\n\nI paused the video and stared at my room. My brain whispered:\n\n“Folding that t-shirt on the chair will take less than 3 minutes…”\n\nSo I got up. Folded the t-shirt.\n\nIt was such a small thing.\n\nBut I wasn’t lying in bed anymore.\n\nThe Magic Behind 3 Minutes\n\nWe don’t avoid tasks because they’re hard.\n\nWe avoid them because starting feels overwhelming.\n\nThat’s why this rule worked for me. It tricks the brain.\n\nInstead of telling yourself “I need to study for 2 hours,” you just say,\n\n👉 “Let me study for 3 minutes.”\n\nThe pressure disappears.\n\nNine out of ten times, once you start, you go way beyond those 3 minutes.\n\nIt’s like pushing a car — the hardest part is the first shove. After that, momentum takes over.\n\nHow I Used It in Real Life\n\n🧹 Cleaning My Room\n\nInstead of saying “Ugh, I have to clean everything,” I said:\n\n“Just wipe the desk. 3 minutes.”\n\nBefore I knew it, I had cleaned the whole room in 15 minutes.\n\n📚 Studying\n\nI told myself: “Just revise one flashcard. 3 minutes.”\n\nI ended up studying for 45 minutes without realizing.\n\n📩 Replying to Emails\n\n“Just open Gmail and respond to one message.”\n\nThat one turned into five.\n\nWhy It Works (Even If You're Super Lazy)\n\nNo pressure = No resistance\n\nYou’re not committing to hours. Just 180 seconds.\n\nQuick wins = Dopamine boost\n\nFinishing something small makes your brain feel successful.\n\nMomentum is powerful\n\n3 minutes becomes 10, then 30, then done.\n\nThings You Can Try Right Now\n\nHere are examples of things you can start with the 3-minute rule:\n\nMake your bed\n\nDo 10 push-ups\n\nWrite 3 sentences in your journal\n\nOpen that book you’ve been avoiding\n\nDelete 5 unnecessary files from your laptop\n\nText someone you've been putting off\n\nFinal Thoughts: Small Steps, Big Changes\n\nIf you’re someone like I was — stuck, unmotivated, always saying “I’ll do it later” — I want you to try this rule.\n\nNot tomorrow. Not later. Right now.\n\nPick one thing that takes less than 3 minutes and just do it.\n\nThen watch how your entire day — and eventually, your life — starts shifting.\n\nSometimes, it only takes 3 minutes to break the chains of laziness.","label":0,"source":"https:\/\/medium.com\/@pteja9737\/how-i-overcame-laziness-using-a-3-minute-rule-0f56d863c814?source=rss------mental_health-5"}
{"id":"medium_b387044f","title":"Where Does My Soul Belong?","text":"Where Does My Soul Belong? oyku 2 min read · Just now Just now -- Listen Share\n\nSometimes we feel lost with our friends, our family, or our lover – whoever we are with. Streets we know very well start to feel unfamiliar. We feel like we don’t know the people next to us. We feel like we don’t belong where we are. Sometimes, we even feel like a stranger in our own room. Maybe our soul thinks that this is not the place where we truly belong.\n\nEverything becomes blurry and we lose our direction. This feeling is often scary, but it is also a part of growing and changing. Because feeling lost gives us a chance to find new paths. What is important is to find something that makes us happy and a place where we feel like ourselves.\n\nEvery journey brings us new things. Even when we have trouble finding our way, we still make progress. And this helps us find our true path. Do your best to live the life you really want. Have a life where you feel like you truly belong and where you feel like yourself.\n\nGive yourself some time. Ask yourself questions like, “Who am I?”, “Where do I want to be in this life?”, and “Where will I be happy?”. When you discover your answers, follow them on your road to happiness.\n\nDon’t be afraid of feeling lost. Sometimes, the most beautiful roads are found without a map. Maybe we need to feel lost to find ourselves.","label":0,"source":"https:\/\/medium.com\/@oyku15guler\/where-does-my-soul-belong-cf295b3537f5?source=rss------mental_health-5"}
{"id":"medium_892ee0c7","title":"Hope is a driver. We’re all just vehicles.","text":"Hope is a driver. We’re all just vehicles. Sathvik Reddy 3 min read · Just now Just now -- Listen Share\n\nA reflection on what it means to keep going when tomorrow feels uncertain.\n\nImage by Dmitry Ratushny\n\nHope is the driver. We’re all just vehicles.\n\nIt drives some to death, some to life, and some to a place where life and death carry no meaning.\n\nWhat exactly is hope? What gives me hope?\n\nIs it the belief that I will be free someday, or is it the quiet thought about the future being different from present?\n\nIs it the story I repeat to myself every day as a reason to live tomorrow when there was no point in living all the yesterdays?\n\nMaybe it’s the idea that all of this will change someday.\n\nHope can be many things. It’s the feeling that things could be better.\n\nIt’s the lifeline we reach for when everything else feels like it’s slipping away.\n\nBut hope isn’t always gentle.\n\nIt’s not always kind.\n\nHope can also be like a sweet poison, giving us a slow death.\n\nHope is a dangerous thing. Hope can drive a man insane.\n\nHope is a good thing, maybe the best of things, and no good thing ever dies.\n\nThe two lines are from the movie Shawshank Redemption.\n\nTwo opposing truths from the same film.\n\nHope is a dangerous thing when we live with it. The same hope appears to be a divine thing when we live through it and finally stand in that beautiful moment we have been imagining all these days.\n\nWhen people struggle in life they feel like living in hell. When the same people become successful or peaceful someday, they will praise the life when they were struggling.\n\nIt’s all the same thing. We are disturbed, frustrated, and irritated by things that are not understood yet. But one day, when we make a sense out of them, some of them seem to be so small, some beautiful, and some meaningful.\n\nMaybe that’s what life is about. A constant shift between what we can’t yet understand and what we someday will.\n\nThe whole point is that we are unable to see the future.\n\nWe feel pain today if we think tomorrow will be painful.\n\nWe feel peaceful today if we think tomorrow would be happier.\n\nWe feel thrilled today if we think tomorrow will be exciting.\n\nOur emotions aren’t just responses to our circumstances. they’re tied to the stories we tell ourselves about the future.\n\nMaybe for the first time when people felt these things. They started to think that maybe of all the things, the pain right now was the only thing that should be thought about replacing with something that makes them feel better (cause it’s pain and not a single one if given a chance, will choose to feel pain).\n\nSo, here was born hope. Tomorrow will be painful, but the day after may be better, and someday maybe we will be happy.\n\nI had hope from the moment I knew about hope. I even had it before, but maybe I just didn’t know it was hope. It was there in every quiet moment I survived. A man without hope is either too happy or maybe trying to kill himself. Too happy is a tale to me. The only times in my life I felt it was true were when I was too drunk with my friends.","label":0,"source":"https:\/\/medium.com\/@nsreddy1729\/hope-is-a-driver-were-all-just-vehicles-270628dbe653?source=rss------mental_health-5"}
{"id":"medium_c85825b9","title":"The Third Challenge: Understand Depression’s Painful Ripple Effect","text":"The Third Challenge: Understand Depression’s Painful Ripple Effect\n\nAcknowledgment of hidden wounds on our loved ones Smwildreness 5 min read · Just now Just now -- Share\n\nGenerated by Gemini\n\nWhen Truth Becomes Unfamiliar\n\nIn the depths of depression, I learned something that takes my breath away: truth becomes a stranger in your mind.\n\nThe voice that whispered worthless felt real. The echo that said unlovable knew my heart better than I did. In moments when darkness felt like my companion, I believed every cruel lie about who I was.\n\nI need to tell you something I took a long time to understand.\n\nDespite the lies my depression told me, the support of those around me revealed the truth.\n\nThe Angels Stay\n\nYou know the saying, “Your shadow leaves you in the dark”?\n\nUntil I discovered something extraordinary in my lowest moment, I believed it.\n\nWhen my shadow abandoned me and I felt invisible, people chose to sit with me in that darkness. Sometimes, they said nothing. They just stayed. Even when I begged them to leave. Even when I convinced myself they’d be better off without me.\n\nThese angels refused to leave me to my pain.","label":1,"source":"https:\/\/medium.com\/readers-digests\/the-third-challenge-understand-depressions-painful-ripple-effect-220d6053a47c?source=rss------depression-5"}
{"id":"medium_c2c46fe6","title":"Fractured.","text":"Fractured. Sanskruti 2 min read · Just now Just now -- Listen Share\n\n(I wrote this because I was tired of living for applause I didn’t ask for. Trapped in my own skin, performing for a crowd that never clapped — this is what dreaming about breaking free looked like.)\n\nIf I were placed behind a pellucid wall,\n\nWould you have called me protected or truculent?\n\nIf my fearsome soul —\n\nWas sold for a droll role,\n\nIf perfection had been forced upon me,\n\nIf I wore grace like it was stitched in lace,\n\nA mask I had mastered, poised and grave,\n\nIf I had the soul of a warrior in a queen’s frame —\n\nWould you have pitied me, or called me brave?\n\nYes, I did everything for the show,\n\nAnd my heart was filled with vases of sorrow\n\nOne breeze of air, and it would shatter\n\nleaving me in pieces that clatter.\n\nYou knew my thoughts\n\nYou knew it all, yet —\n\nYou played with me from dusk till dawn,\n\nuntil I broke beneath the weight,\n\nand named my caged fate,\n\nNo one wondered how long I could pretend.\n\nI let go, and finally, I uttered\n\nI said, kill me from the crushing and thriving,\n\nThen place a black iris on the stone,\n\nwhere I once stood ash and bone,\n\nthrow fire at me, watch me burn —\n\nAnd tell me, did you have your fun?\n\ntorture me,\n\nuntil I scream and shout and ask —\n\nWas that necessary?\n\nThen, proceed to call me crazy.\n\nLet me tell you the story of a girl,\n\nWho dreamt so small,\n\nand walked like a churl,\n\nHer psyche was in the wilderness,\n\nShe walked no road, followed no muse\n\nAll she had was the hope of flying\n\nfar from the flock, no longer complying.","label":0,"source":"https:\/\/medium.com\/@sanskrutii13\/fractured-fd22f76731e4?source=rss------depression-5"}
{"id":"medium_391c6d72","title":"The Kind of Pain That No One Sees","text":"The Kind of Pain That No One Sees\n\nAnxiety and Depression Isn’t Just “Feeling Sad” Leighann Ash 4 min read · 3 hours ago 3 hours ago -- Share\n\nPhoto by Anthony Tran on Unsplash\n\nCue sarcasm. “Oh, you just have it so bad, don’t you?”\n\nThey say I’m being too much. That I should just “be more positive.”\n\nBut here’s the thing: I don’t think my life is harder than anyone else’s. I just suffer in ways most people don’t understand.\n\nUnless you’ve lived with anxiety and depression, not just for a day or a week, but for years, you have no idea how heavy it feels to carry this kind of weight all the time.\n\nThis isn’t just “feeling sad.” It’s struggling to function, smile, breathe, and just exist. And it’s invisible. Which makes it easy for people to dismiss, which makes me feel judged.\n\nThey think I’m just being dramatic.\n\nI started noticing a disconnect when I’d open up about my struggles. People would respond with, “you’re just overthinking it,” or “you don’t look depressed.” The worst part is that I started to believe them.\n\nI thought there was something wrong with me. Maybe I was too sensitive.\n\nBut deep down, I knew this wasn’t just a phase. It wasn’t a mindset issue. It was real. And it was ruining my life.","label":1,"source":"https:\/\/medium.com\/new-writers-welcome\/the-kind-of-pain-that-no-one-sees-0bfd1a162b69?source=rss------depression-5"}
{"id":"medium_ab576488","title":"Pt. 2: The Quiet Collapse","text":"Pt. 2: The Quiet Collapse Peak Afflatus 4 min read · 4 hours ago 4 hours ago -- Listen Share\n\nWhen self-awareness becomes self-harm\n\nThe Slow Drift\n\nFor years I felt myself sliding. Lacking any real sense of direction or purpose — when you don’t know where you’re sailing, no wind is fair.\n\nI have spent most of my adult life abroad, searching for adventure and experience away from the crowds. Quietly satisfying myself with solo pursuits and quiet ambition, shaped not by attention, but by curiosity and contentment.\n\nSilent Accent\n\nI’d found a niche in a business where I could play a big part while remaining low-key, balancing success with servitude. It was exciting to sense the possibilities that lay ahead, to feel part of something people were proud of.\n\nThe Cracks Appear in Perfectionism\n\nBut when personal vision began to butt up against demands, something shifted. My abnormally high conscientiousness clashed with a deep desire for autonomy, a pattern I was familiar with. Slowly, the grinding reality of work wore down my aspirations of greatness, polluting them with over-intellectualised, critical negativity. I knew this was bias. On paper, I had it good.\n\nI kept trying to pinpoint the change in myself, but it was a way of thinking that stretched back as far as I could remember, trying to be everything to everyone, but too self-critical and afraid to meet my own expectations.\n\nMy ego ideal turned my inner voice hostile, the auto-aggression seeping into everything I did. You could argue it drove me to try harder, but the cost was self-hate of epic proportions.\n\nThe Inner Erosion\n\nIt became a kind of learned helplessness, an apathy that started to rot my personhood. I didn’t deserve this role; I was a hack. A consummate chameleon. An algorithm that could deliver results without instinct, without the spark of a true creative.\n\nThe opposing forces of believing I deserved more and feeling unworthy bred a visceral conflict. Like a self-fulfilling prophecy, the more I ruminated on it, the more I hollowed out my own sanity.\n\nCorrosion and Withdrawal\n\nLike an anode protecting a ship’s engine, I tried to shield the business with my own degradation. Whether in silence or in meetings, I’d attempt to steer things toward the greater good despite a strong aversion to confrontation. Over time, withdrawal became the safest harbour, and the hull heavy with weed.\n\nMy increasingly loud internal monologue was collapsing the scaffolding of self, passing up opportunity and growth for the mediocre comfort of the familiar. Misery loves company.\n\nWhen you feel you’re no longer at the wheel and heading to someone else’s destination, cutting off your nose to spite your face starts to feel like a legitimate solution.\n\nRighteous and Weak\n\nI’d lost the youthful courage to go my own way, trapped instead in the obligations of senior ranks and expectations and a desire not to repeat patterns of running away. I was facing the wrath of my own indecision.\n\nMy values and integrity were at odds with the behaviour around me and I tried to suppress the inner conflict. It is business after all, and not mine at that. I’d always advocated for individuals to work in the way that suited their strengths, accepting that while it wasn’t how I’d do things, it remained a path to their own results.\n\nOver time though, as others’ methods began to affect my own, I wondered why I had to suffer their shortcomings. I had plenty of my own to deal with, and being good at sorting theirs had carved a rut I was stuck in.\n\nWhen I sensed the corporate machine gearing up to ‘resolve’ things, I took it as an affront. I’d seen these processes rolled out before, and I wasn’t about to be on the receiving end of it.\n\nIt’s a humbling thing to feel both righteous and weak. The ego wants to go out guns blazing. The inner child is stricken with grief. The collision of both is messy.\n\nRoutine as Armour\n\nBeneath the surface of this unravelling, there was a survival mechanism. The rigour with which I followed routine was militant, an attempt to cope and overcome.\n\nThe same nutrient-dense homemade salad for lunch. The same brisk walk. The same non-fiction podcast rotation. The latter designed to educate and drown out the familiar internal slander.\n\nRoutine kept the wheels turning, kept me upright, even as everything else listed. It was an attempt at control while the rest of life slipped from my grasp.\n\nThe Revolt\n\nIt seeded in me a defiance I couldn’t control. I was no longer an inmate — I was ready to go rogue.\n\nInstead of falling in line I stepped out, quite literally, of the building. Mind on fire with outrage, I’d never demanded respect, but I wasn’t about to suffer another moment of others’ misguided self-aggrandisement.\n\nI had, for all intents and purposes, architected my own collapse. And I was about to spiral to depths unseen.\n\nDepersonalisation to the edge\n\nI was a deeply depressed robot, running on auto. Anhedonic. Whose was this body I was inhabiting? Why did I feel like a stranger to myself?\n\nI began to wonder who I was at all, as the running joke of my awful memory made me question what identity even meant without recalled experience.\n\nWho are you, when you forget?\n\nI had reached the point where walking out the door felt like the only honest act left. The last refusal and gesture of agency. But it was no longer a choice.\n\nThe collapse was only the beginning. The fall that followed was fast. Ferocious. Absolute.\n\nIf you’d like to support my work visit ko-fi.com\/peakafflatus","label":1,"source":"https:\/\/medium.com\/@peak.afflatus\/pt-2-the-quiet-collapse-71428b8d2dc1?source=rss------depression-5"}
{"id":"medium_f19e76d5","title":"Busy, But Still Sad: How Staying Active Helps Me Ride the Lows of Depression","text":"Busy, But Still Sad: How Staying Active Helps Me Ride the Lows of Depression Jolene Gongora 2 min read · 4 hours ago 4 hours ago -- Listen Share\n\nThere are days when depression sits so heavy on me, I feel like I can’t move. Days where my body feels like concrete and my thoughts feel like fog.\n\nAnd still — I’ve learned to stay busy. Not because it magically “cures” anything. It doesn’t. But because it gives me something to hold onto when everything else feels out of reach.\n\n👉 The trick isn’t forcing myself to be happy. It’s gently, quietly, staying in motion.\n\nI’m not talking about overloading myself with tasks or pretending I’m fine. I’m talking about small things:\n\n• Doing the dishes\n\n• Taking a short walk\n\n• Watering my plants\n\n• Writing a to-do list with just one thing on it\n\nSometimes I clean out my junk drawer just to give my brain a job that isn’t self-criticism. Sometimes I reorganize my closet because folding jeans feels easier than untangling my emotions.\n\nOn the hard days, I call it “productive distraction.” A way to keep moving without letting depression pull me completely under.\n\n🌱 When I stay busy, I remind myself I’m still here.\n\nIt doesn’t cure the sadness, but it gives me tiny pockets of peace — and on some days, that’s enough.\n\nIf you’re in a low right now, please know you’re not lazy. You’re not broken. You’re carrying something heavy.\n\nTry moving just a little.\n\nDo something simple.\n\nAnd when that feels like too much, rest. Then try again tomorrow.\n\n🖤 You’re not alone in this.","label":0,"source":"https:\/\/medium.com\/@jolene.cp2\/busy-but-still-sad-how-staying-active-helps-me-ride-the-lows-of-depression-19e06bbc3d5c?source=rss------depression-5"}
{"id":"medium_3f918646","title":"How to Overcome Depression: Lessons that Helped me Heal","text":"Here are the lessons I’ve learned along the way – lessons I hope might light the path for someone else.\n\n1. Acceptance\n\nIt’s not easy to accept that something you’ve always been taught to see as a weakness is now part of your reality. But accepting depression doesn’t mean you’ve failed – it means you’re human. Depression is as common as the flu; just as anyone can catch a cold, anyone can experience depression at some point in life. There is no shame in it, and there is nothing wrong with you. Acceptance is the first and most healing step. Once you accept it, you’ll be ready to take the steps needed to heal.\n\n2. Just go through it\n\nIt’s incredibly painful to admit that you’re in a dark place – but denying it won’t make it go away. Trust me: the clouds will part, and the sun will shine again. The only way out is through. And when you come out the other side, you won’t be the same – you’ll be stronger, wiser, and free. A different version of you will emerge from the storm.\n\n3. Remind yourself that you don’t want to feel this way\n\nEvery time you acknowledge that this pain isn’t something you chose – and that your true desire is to feel better – you take a powerful step forward. That quiet but honest admission creates space between you and the suffering. It reminds you that this state isn’t permanent, and it’s not your identity. From that place of clarity, you’ll find the strength to start doing whatever it takes to change your situation.\n\n4. Be careful who you talk to\n\nWhen I opened up to friends about my depression, I often ended up feeling worse. Sometimes, they’d shift the conversation to their own, more dramatic stories – as if we were competing over who was suffering more. Other times, they’d reinterpret my experience in a way that made it all feel like my fault. But in those moments, I didn’t need analysis or comparison – I needed someone to simply validate my pain and help me find a way out of the darkness.\n\n5. Ask for professional help\n\nIt took me six therapists and a couple of years to find the one who truly understood me. Finding the right person can take time – but it’s worth it. Don’t give up on the search just because the first (or fifth) match isn’t right. The right therapist won’t just treat your symptoms – they’ll build a relationship with you that becomes part of your healing. Keep looking until you find someone who sees you and walks the journey with you.\n\n6. Be patient\n\nHealing doesn’t happen in a single moment – it’s a process, and sometimes a messy one. Some days feel like progress, others feel like setbacks, and some therapy sessions can be harder than the last. But that’s all part of the journey. Patience is what carries you through the darkest stretches toward the light at the end of the tunnel. Trust the process, even when it’s slow.","label":0,"source":"https:\/\/afshari-ladan.medium.com\/how-to-overcome-depression-lessons-that-helped-me-heal-05e4b7159101?source=rss------depression-5"}
{"id":"medium_9240bad8","title":"Understanding High Functioning Depression 💚","text":"Understanding High Functioning Depression 💚 Jahli Creations 4 min read · Just now Just now -- Listen Share\n\nAn introduction guide to understanding, empathizing, or surviving with Persistent Depressive Disorder! ✨\n\nWhat is Persistent Depressive Disorder or High Functioning Depression? This is the fairly new diagnosis for Chronic Depression. To be diagnosed you must experience a depressed mood or symptoms for multiple days\/phases for at least two years or more. Symptoms can include; a lack of manic or hypomanic episodes, poor appetite or overeating, insomnia or hypersomnia, low energy or fatigue, low self-esteem, poor concentration or focus, difficulty decision making, feelings of hopelessness, or unable to function. Keep in mind that, those suffering with PPD experience these symptoms to a slightly less degree so they can function more often than those with Major Depressive Disorder. Because of this, symptoms may be more mild and less obvious to onlookers.\n\nAnother important factor is that symptoms can not be an onset caused from substance or alcohol abuse and medical issues. There are no brain scans, blood tests, or other tests to determine PDD. It must be diagnosed by your medical professional after receiving treatment, asking questions, and problem solving.\n\nNow let’s look at some important facts and statistics regarding Persistent Depressive Disorder. Women are three times more likely to experience PDD than men while 3% of the U.S. population suffers from PDD. Those also struggling with Borderline Personality Disorder are 70% more likely to have PDD. It’s also important to acknowledge that 80–90% of people will develop PDD at some point in their life, mostly developing in childhood, teenagers, or young adulthood. While that statistic may intimidate some people, acknowledge that there is no way to prevent PDD and you are not alone. The first symptoms (while mild) can look like; negativity, low self-esteem, overdependent, lack of self confidence, self doubt, feeling hopeless, or withdrawal. If you begin to experience these, make sure to seek treatment immediately.\n\nSo what causes Persistent Depressive Disorder? The actual cause is still unknown and yet to be determined. However, it has been contributed to a few causes such as; biology, brain chemistry, inherited traits, stress level, and trauma. When we look at brain chemistry, often those suffering with PDD lack serotonin, norepinephrine, or dopamine. It can be a combination of all three or one that is lacking. Researchers are still studying how PDD affects brain chemistry and brain development to find more correlations between the two.\n\nNow that we’ve dived into what Persistent Depressive Disorder is, how to spot early symptoms, and the science behind it, let’s address how we can cope with PDD. The first step is always to acknowledge your symptoms and seek counseling or medical treatment. Once you’re diagnosed, you’ll want to find ways to relieve and manage your stress. The most effective proven treatment for PDD is a combination of medication and talk therapy. The most common medication is antidepressants, also known as; Selective Serotonin Reuptake Inhibitors (SSRIs) or Serotonin- Norepinephrine Reuptake Inhibitors (SNRIs). If you are against medication, talk to your provider about possible natural herbs and vitamins that can help you. It is crucial to always speak with your provider first because self medicating can lead to Serotonin Syndrome or an increase in anxiety and depression. Aside from talk therapy, other therapies can include Cognitive Behavioral Therapy (CBT), Interpersonal Therapy (IPT), and a couple of newer therapies called Cognitive Behavioral Analysis of Psychotherapy and Radically Open Dialectical Behavior Therapy (RO-DBT).\n\nWhat if medication and treatment does not have positive results? In worst case scenarios there is Repetitive Transcranial Magnetic Stimulation (rTMS) or Electroconvulsive Therapy (ECT). These treatments are rarely recommended and are seen as a “last resort” option. It’s also important to know that these treatments have severely negative and long lasting side effects. NEVER consider these treatments as a first option.\n\nIf you do not wish to seek medication or treatment, your care provider may also recommend; exercising, relaxing activities, healthy eating habits, building and maintaining a positive support system, and healthy sleeping habits. NEVER look to self medicate or abuse substances to cope. This can lead to a codependency or addiction which may worsen your symptoms. In emergency situations, call or text a crisis lane to get immediate help.\n\nIf you or a loved one are fighting Persistent Depressive Disorder, it’s important to raise awareness, break the stigma, and advocate for mental health. Take a moment today to share your love and support for those struggling today, even if it’s yourself. Remember that you or your loved ones are not alone. There are many resources, treatments, and steps that can lead to a fulfilling and beautiful life.","label":1,"source":"https:\/\/medium.com\/@jahlicreations\/understanding-high-functioning-depression-e1cca195e32e?source=rss------depression-5"}
{"id":"medium_9cc8918e","title":"Delayed Texts","text":"Photo by Miquel Parera on Unsplash\n\nYou text them\n\nAn answer is needed urgently\n\nThey start to write\n\nYour hopes go up\n\nImmediately\n\nBut their answer\n\nNever seems to come\n\nUnfortunately\n\nFor what seems\n\nLike a hellish experience\n\nYour mind and heart and soul\n\nSlowly start to shrink a little bit\n\nAs your eyes\n\nGlued to the phone screen await\n\nThe end of this unusual torture","label":0,"source":"https:\/\/medium.com\/@charlesnkoho\/delayed-texts-c3527513f9dc?source=rss------anxiety-5"}
{"id":"medium_199b7e1b","title":"7 Signs of Anxiety I Missed — Until They Almost Burned Me Out","text":"7 Signs of Anxiety I Missed — Until They Almost Burned Me Out Esha Usmani 3 min read · Just now Just now -- Listen Share\n\nI thought I was just tired.\n\nJust stressed.\n\nPhoto by Pawel Czerwinski on Unsplash\n\nJust someone who needed a weekend to reset.\n\nBut no amount of naps, silence, or journaling pulled me out of the constant hum in my chest. The pressure behind my eyes. The guilt of doing “nothing.”\n\nTurns out, it wasn’t laziness.\n\nIt wasn’t burnout.\n\nIt was anxiety — high-functioning, quiet, always-there anxiety.\n\nAnd I had no idea.\n\nThis is for anyone who seems fine on the outside, but inside? You’re fighting to stay afloat in your own mind.\n\n1. I Over-Explained Everything\n\nI’d rewrite texts three times.\n\nI’d send paragraphs apologizing for things no one was upset about.\n\nI’d add “if that’s okay!!” or “just checking in, no pressure” even when I was allowed to ask.\n\nAnxiety made me think I had to over-explain to be understood.\n\nBecause what if they read it wrong?\n\nWhat if I sounded harsh?\n\nWhat if I was “too much”?\n\n2. I Couldn’t Relax — Even When I Was Doing Nothing\n\nI’d finally get time off.\n\nBlanket. Show on. Snacks ready.\n\nBut my brain? Still running.\n\nDid I reply to that email?\n\nI should be planning next week.\n\nWhy am I resting — there’s still so much to do.\n\nAnxiety doesn’t always look like panic.\n\nSometimes, it’s sitting still but feeling guilty for it.\n\n3. I Got Irritated — Then Blamed Myself for It\n\nLittle things started bothering me.\n\nNoise. Plans changing. People being late.\n\nAnd I’d react. Not loudly, just sharply. Then feel awful for snapping.\n\nAnxiety made me feel like I was always on edge — and like I had no right to be.\n\n4. My Sleep Was… Off\n\nSome nights, I couldn’t fall asleep.\n\nOther nights, I woke up at 3 a.m., wired and wide-eyed.\n\nHeart pounding. Thoughts racing.\n\nNo real reason. Just… alert.\n\nIt wasn’t insomnia. It was my body being stuck in fight-or-flight — even while lying in bed.\n\n5. I Said “Yes” to Everything — and Then Resented It\n\nNeed help with that project? Sure.\n\nWant to talk? Of course.\n\nCan you come even if you’re tired? Yeah, no problem.\n\nI kept agreeing to things to avoid disappointing people.\n\nAnd then quietly feeling frustrated, overwhelmed, and drained.\n\nPeople-pleasing isn’t always about being nice.\n\nSometimes it’s fear dressed up as “I’m fine.”\n\n6. I Was Always “Productive” — But Never Present\n\nI got things done. My to-do list stayed full.\n\nBut I didn’t feel there.\n\nI wasn’t enjoying it. I was just performing.\n\nProductivity became my coping mechanism.\n\nIf I was busy, I didn’t have to feel the anxiety underneath.\n\n7. I Thought Asking for Help Made Me Weak\n\nEven when I knew I was drowning, I kept quiet.\n\nDidn’t want to be a burden.\n\nDidn’t want to “worry” anyone.\n\nDidn’t want people to see me struggling.\n\nBut I was. Quietly. Constantly.\n\nI didn’t know how to say “I’m not okay” — because I thought not being okay meant I was failing.\n\nWhat Changed\n\nThere wasn’t one dramatic breakdown.\n\nJust a slow realization: this isn’t normal.\n\nI shouldn’t be this exhausted from doing the bare minimum of life.\n\nI wasn’t lazy. I wasn’t dramatic.\n\nI was anxious — and I didn’t even know that’s what it was.\n\nWhen I finally learned what high-functioning anxiety looked like, I cried. Not because I was scared — but because I finally had a name for the heaviness.\n\nIf This Is You Too\n\nYou’re not alone.\n\nYou’re not weak.\n\nYou’re not “overthinking” everything for fun.\n\nYou’re just someone whose brain learned to stay on high alert — and that’s not your fault.\n\nAnxiety doesn’t always scream.\n\nSometimes it whispers, and we don’t hear it until we’re burned out, shut down, or completely exhausted.\n\nBut you can learn to listen earlier.\n\nAnd when you do — that’s not failure. That’s healing.\n\nEver experienced signs like these and didn’t realize they were anxiety? Feel free to hit reply or drop a comment — I’m listening.","label":1,"source":"https:\/\/medium.com\/@esha.usmani.3\/7-signs-of-anxiety-i-missed-until-they-almost-burned-me-out-785b8889f9c5?source=rss------anxiety-5"}
{"id":"medium_f760fb46","title":"The Uncomfortable Truth About Modern Life","text":"The Uncomfortable Truth About Modern Life\n\nHow too much ease harms our well-being…. Rosa Diaz-Casal 5 min read · Just now Just now -- Share\n\nPhoto by Mikhail Nilov: https:\/\/www.pexels.com\/photo\/a-woman-using-her-credit-card-and-laptop-in-online-shopping-6969932\/\n\nLife has become easier and more convenient in so many different ways. A lot of things are available instantly and real discomfort has become less common for many of us.\n\nBut, at the same time, many people feel more anxious, unmotivated or disconnected even when nothing seems wrong on the surface.\n\nIn his book, The Comfort Crisis, author Michael Easter talks about things that seem helpful but actually do harm and what we can do instead.\n\nSo many of us live in cities. We are drawn to places where there are opportunities, movement, people, and comfort. According to this book, it is actually rooted in our instincts. Our brains are wired to seek out environments that feel rich with resources or chances to grow or connect.\n\nBut what happens when we never leave that environment? What happens when life becomes all comfort, all convenience, all man-made city life?\n\nMost of us now live surrounded by artificial light and constant noise — cars, trains, footsteps above, traffic outside the window, maybe neighbors talking through thin walls. Even when we think we are used to it, our nervous systems are still reacting to it all the time.","label":0,"source":"https:\/\/medium.com\/walks-of-life\/the-uncomfortable-truth-about-modern-life-5999d0afc2e8?source=rss------anxiety-5"}
{"id":"medium_478a3cbe","title":"The Root of My Anxiety Wasn’t What I Thought — It Was Me Not Trusting Myself","text":"Photo by Sage Friedman on Unsplash\n\nThe Root of My Anxiety Wasn’t What I Thought — It Was Me Not Trusting Myself Vivi Fame 4 min read · 3 hours ago 3 hours ago -- Listen Share\n\nFor a while now, I’ve wondered why I struggle to fully communicate — even in simple, everyday conversations with family. And recently, I think I uncovered a big part of the reason.\n\nIt’s anxiety.\n\nNot the loud, panicked kind — but the subtle kind that hides in how I articulate my thoughts.\n\nI noticed that whenever I speak, I tend to rush. I talk so fast, jumbling my words, even when the message is clear in my head. Why?\n\nBecause I’ve been afraid that people wouldn’t have the patience to really listen. That if I take too long, or tell a story slowly, they’ll lose interest or stop engaging. And if I tell a joke and it doesn’t land? My mind spirals.\n\nAnother part of the anxiety comes from fear of not sounding “smart enough.” That maybe I won’t use the right grammar or my words won’t come out polished. So while I’m speaking, I’m also overthinking — and that jumbles everything even more.\n\nBut recently, I told myself something new:\n\n“I’m just going to slow down and talk. No one’s going to punch me for it.”\n\nPeople speak at a regular pace all the time. They mess up, pause, take their time — and no one scolds them. So why should I expect less grace for myself?\n\nAnd even if someone does get impatient?\n\nThat’s a them problem, not a me problem.\n\nBecause I know what I’m saying.\n\nPhoto by Ashlyn Ciara on Unsplash\n\n💭 A Mindset Shift I Didn’t Expect\n\nI used to tell myself that the reason I stumbled over my words was because I didn’t know how to articulate my thoughts. But the truth is — I do.\n\nWhen I slow down, I speak better.\n\nWhen I write without rushing, I communicate more clearly.\n\nAnd I actually noticed that in the text I wrote just before this one — it was calm. Not chaotic. Not jumbled. It flowed. Because I chose to write without fear — without the rush to “just get it all out before I forget.”\n\nEven as I was entering a keke that day, I had an idea I wanted to write down. But the seat I got didn’t make it easy, and anxiety tried to creep in with this old fear:\n\n“You’re going to forget it. You won’t be able to write it later.”\n\nBut this time, I stopped that thought.\n\nI told myself, “No. I’ll remember it. I trust myself.”\n\nAnd just like that… I felt calm.\n\nNot just in my mind — in my entire body.\n\nPhoto by Good Faces on Unsplash\n\nWhat That Moment Taught Me\n\nThere’s been so much internal chaos in me. And I realized — I was the one creating it.\n\nBecause the moment I treated myself like a smart girl — like someone who could actually control her thoughts and memory — I felt something I hadn’t felt in a while:\n\nConfidence. Clarity. Calm.\n\nAnd that’s when it all clicked.\n\nThe root of my anxiety wasn’t just fear.\n\nIt was a lack of self-trust.\n\nIt was the belief that I couldn’t handle things.\n\nThat I would forget.\n\nThat I wasn’t enough — and never would be.\n\nI used to dress it up as humility, but it wasn’t.\n\nIt was self-doubt.\n\nAnd honestly, it was tearing me down.\n\n❤️ The Real Work: Trusting Myself\n\nNow I see that self-love isn’t complete without self-trust.\n\nI have to believe that I can remember. That I do know what I’m saying. That I am capable.\n\nBecause the way I treat myself — the thoughts I speak over myself — that’s what sets the tone for how others treat me, and how I show up in the world.\n\nAnd guess what?\n\nI am growing.\n\nI am learning.\n\nAnd it’s showing — not just in my writing or speaking, but in the way I talk to myself.\n\nSo no, I’m not going to keep hiding behind fear of imperfection.\n\nI’m not going to rush my words or doubt my thoughts.\n\nI’m not going to dim my expression because I think I’m not “good enough.”\n\nThere’s a clear difference between arrogance and confidence.\n\nAnd what I’m walking in now — this is confidence.\n\nThe kind rooted in grace, growth, and truth.\n\nWith calm and courage,\n\nVera\n\n#TheRubyProcess #BecomingHer #ConfidenceJourney #OvercomingAnxiety #SelfTrustIsPower","label":1,"source":"https:\/\/medium.com\/@iamvivifame\/the-root-of-my-anxiety-wasnt-what-i-thought-it-was-me-not-trusting-myself-aab6c9a249f2?source=rss------anxiety-5"}
{"id":"medium_a8a62039","title":"The Kind of Pain That No One Sees","text":"The Kind of Pain That No One Sees\n\nAnxiety and Depression Isn’t Just “Feeling Sad” Leighann Ash 4 min read · 3 hours ago 3 hours ago -- Share\n\nPhoto by Anthony Tran on Unsplash\n\nCue sarcasm. “Oh, you just have it so bad, don’t you?”\n\nThey say I’m being too much. That I should just “be more positive.”\n\nBut here’s the thing: I don’t think my life is harder than anyone else’s. I just suffer in ways most people don’t understand.\n\nUnless you’ve lived with anxiety and depression, not just for a day or a week, but for years, you have no idea how heavy it feels to carry this kind of weight all the time.\n\nThis isn’t just “feeling sad.” It’s struggling to function, smile, breathe, and just exist. And it’s invisible. Which makes it easy for people to dismiss, which makes me feel judged.\n\nThey think I’m just being dramatic.\n\nI started noticing a disconnect when I’d open up about my struggles. People would respond with, “you’re just overthinking it,” or “you don’t look depressed.” The worst part is that I started to believe them.\n\nI thought there was something wrong with me. Maybe I was too sensitive.\n\nBut deep down, I knew this wasn’t just a phase. It wasn’t a mindset issue. It was real. And it was ruining my life.","label":1,"source":"https:\/\/medium.com\/new-writers-welcome\/the-kind-of-pain-that-no-one-sees-0bfd1a162b69?source=rss------anxiety-5"}
{"id":"medium_38146a42","title":"The Anxiety of Never Slowing Down","text":"The Anxiety of Never Slowing Down Jonas.Vale 2 min read · 3 hours ago 3 hours ago -- Listen Share\n\nYou wake up with your mind already running.\n\nTasks. Messages. Notifications. Plans.\n\nEven your rest feels rushed.\n\nWelcome to the quiet panic of modern life —\n\nwhere stopping feels unsafe,\n\nand doing nothing feels wrong.\n\n## Always “on”\n\nSomewhere along the way, we confused stillness with laziness.\n\nProductivity became morality.\n\nRest became guilt.\n\nWe don’t pause to breathe.\n\nWe pause to switch tabs.\n\nThen we call that balance.\n\n## The fear of slowing down\n\nSlowing down means facing:\n\n- The thoughts we’ve ignored\n\n- The emptiness we’ve been covering with busyness\n\n- The uncomfortable truth that maybe we don’t know who we are without motion\n\nSo we keep moving.\n\nNot toward something.\n\nBut away.\n\n## When rest becomes foreign\n\nYou’ve been trained to **earn** your rest.\n\nOnly after X tasks, Y hours, Z results.\n\nSo when you stop without permission —\n\neven just for a moment —\n\nyour body relaxes, but your mind revolts.\n\nThat’s not peace.\n\nThat’s exhaustion.\n\n## Learning to pause again\n\nTry this:\n\n- Sit in silence for 10 minutes without a goal\n\n- Go for a walk without your phone\n\n- Let your mind wander without fixing it\n\n- Do something slow — and don’t call it “unproductive”\n\n> Rest isn’t what happens after the work is done.\n\n> Rest is part of the work of being human.\n\n**You don’t have to keep up.\n\nYou just have to come back to yourself.**","label":1,"source":"https:\/\/medium.com\/@jonas.vale.blog\/the-anxiety-of-never-slowing-down-cc4a364ec1d1?source=rss------anxiety-5"}
